In [3]:
# String Operations
import pandas as pd
data = pd.DataFrame({
'Park': ['A', 'A', 'B', 'B'],
'Name': ['Anna','Ben','chris','daisy'],
'Lemonades': [2, 3, 4, 5]
})
data["Name"]=data["Name"].str.capitalize()
data

  Park   Name  Lemonades
0    A   Anna          2
1    A    Ben          3
2    B  Chris          4
3    B  Daisy          5

In [ ]:
#  Data Aggregation and Grouping
grouped=data.groupby("Name") # You are grouping the rows of the DataFrame data based on unique values in the Name column.
grouped # groupby object
for name,group in grouped:
    print("Group:", name)
    print(group)
    print()

Group: Anna
  Park  Name  Lemonades
0    A  Anna          2

Group: Ben
  Park Name  Lemonades
1    A  Ben          3

Group: Chris
  Park   Name  Lemonades
2    B  Chris          4

Group: Daisy
  Park   Name  Lemonades
3    B  Daisy          5

In [7]:
grouped.sum()

      Park  Lemonades
Name
Anna     A          2
Ben      A          3
Chris    B          4
Daisy    B          5

In [ ]:
grouped["Lemonades"].mean() # select only the Lemonades column inside each group and compute mean

Name
Anna     2.0
Ben      3.0
Chris    4.0
Daisy    5.0
Name: Lemonades, dtype: float64

In [ ]:
# Pivot Tables
import pandas as pd
data = pd.DataFrame({'Park': ['A', 'A', 'B', 'B'],
'Name': ['Anna','Ben','chris','daisy'],
'Lemonades': [2, 3, 4, 5]
})
# pivot_table() is used to summarize data by grouping rows and applying an aggregation (mean, count, sum, etc.).
"""values → column you want to analyze
index → row-wise grouping (like groupby)
columns → column-wise grouping 
aggfunc → how to summarize (mean, sum, count, etc.)"""
data.pivot_table(values=["Park","Lemonades"],index="Name", aggfunc="first")

       Lemonades Park
Name
Anna           2    A
Ben            3    A
chris          4    B
daisy          5    B

In [4]:
# Crosstab 
pd.crosstab(data["Name"],data["Lemonades"])

Lemonades  2  3  4  5
Name
Anna       1  0  0  0
Ben        0  1  0  0
chris      0  0  1  0
daisy      0  0  0  1